### Library

In [2]:
import pandas as pd
import numpy as np
import os

### Input Raw Data (6m)

In [3]:
df = pd.read_csv('./dataset/raw/dataset_6m.csv')
df.head()

,month,date,start time,end time,latitude,longitude,user id
0,201411,1,2014-11-01 09:18:08,2014-11-01 09:34:25,NaN,NaN,57ec951bde737466587feaed0d806a11
1,201411,1,2014-11-01 18:12:01,2014-11-01 18:22:34,NaN,NaN,cd6e779892f6c03e22211b25409ba75e
2,201411,1,2014-11-01 18:12:02,2014-11-01 18:21:00,NaN,NaN,cd6e779892f6c03e22211b25409ba75e
3,201411,1,2014-11-01 15:33:03,2014-11-01 15:34:43,NaN,NaN,b341b594239f8b8d36ed78394426af68
4,201411,1,2014-11-01 15:19:10,2014-11-01 15:20:10,NaN,NaN,b341b594239f8b8d36ed78394426af68

### Input Raw Data (15d)

In [4]:
df_min = pd.read_csv('./dataset/raw/dataset_15d.csv')
df_min.head()

,month,date,start time,end time,latitude,longitude,user id
0,201406,1,2014-06-01 10:22:36,2014-06-01 11:09:52,31.237872,121.470259,edbc54bddf16494a49f39ac057b4185d
1,201406,1,2014-06-01 07:00:37,2014-06-01 08:49:20,31.237872,121.470259,f8206ab58b9bdb070673f7050242e9ee
2,201406,1,2014-06-01 02:49:16,2014-06-01 05:49:12,31.237872,121.470259,f8206ab58b9bdb070673f7050242e9ee
3,201406,1,2014-06-01 08:51:58,2014-06-01 09:20:50,31.237872,121.470259,f8206ab58b9bdb070673f7050242e9ee
4,201406,1,2014-05-31 23:49:10,2014-06-01 02:49:07,31.237872,121.470259,f8206ab58b9bdb070673f7050242e9ee

### Overview Data

In [23]:
print("Jumlah missing data:")
df_min.count()

Jumlah missing data:

month         563914
date          563914
start time    563914
end time      563914
latitude      563914
longitude     563914
user id       563914
address       563914
dtype: int64

In [4]:
print("\n Jumlah unique tiap kolom:")
df.nunique()

 Jumlah unique tiap kolom:

month               6
date               31
start time    5326416
end time      5342942
latitude         3025
longitude        3035
user id          9739
dtype: int64

In [5]:
print("Jumlah record tiap kolom:")
df.count()

Jumlah record tiap kolom:

month         6952921
date          6952921
start time    6952921
end time      6952921
latitude      6236620
longitude     6236620
user id       6952921
dtype: int64

In [6]:
print("Jumlah missing data:")
df.isnull().sum()

Jumlah missing data:

month              0
date               0
start time         0
end time           0
latitude      716301
longitude     716301
user id            0
dtype: int64

### Sort by Time

In [5]:
df['start time'] = pd.to_datetime(df['start time'])
df_sorted = df.sort_values(by='start time')
df_sorted.head()

,month,date,start time,end time,latitude,longitude,user id
4013529,201406,1,2014-05-31 23:00:00,2014-06-01 00:35:50,31.414397,121.481621,b7819940e64f9e6628ff74fa32a7a8c7
4005827,201406,1,2014-05-31 23:00:00,2014-05-31 23:47:48,31.078791,121.422082,6fe80cbb5ec2dcf9ab5c54fe4ba92097
4023299,201406,1,2014-05-31 23:00:00,2014-06-01 01:04:51,31.319806,121.526248,b5a3510406b303f1a1f669bb877868e1
4000899,201406,1,2014-05-31 23:00:00,2014-06-01 00:21:06,31.040378,121.255563,bc36fa834270807686c235ab52bb827a
4030612,201406,1,2014-05-31 23:00:00,2014-06-01 00:32:14,31.202912,121.712449,4abcaddda743fefbac7c16a2961ff342

##### Note:

- df = dataframe
- bs = base station
- all = dataset in 6 months range
- min = dataset in 15 days range

### All Data (6 Months)

In [6]:
df_all = df.dropna()

In [7]:
df_all['address'] = df_all.apply(lambda x: str(x['latitude']) + '-' + str(x['longitude']), axis=1)

/tmp/ipykernel_77885/2346694296.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_all['address'] = df_all.apply(lambda x: str(x['latitude']) + '-' + str(x['longitude']), axis=1)

In [8]:
df_all.to_csv(f'./dataset/data_all.csv')

In [11]:
df_all.head()

,month,date,start time,end time,latitude,longitude,user id,address
184,201411,1,2014-11-01 09:14:54,2014-11-01 09:31:41,31.237872,121.470259,0e89b23b6d5824cf6556d06716c65f54,31.237872-121.470259
185,201411,1,2014-11-01 15:45:01,2014-11-01 15:53:24,31.237872,121.470259,1709f1d6ad0d111ecedc9e64ab11437d,31.237872-121.470259
186,201411,1,2014-11-01 17:17:58,2014-11-01 17:22:12,31.237872,121.470259,78c83eaf21c356a2a3579e56df8e9488,31.237872-121.470259
187,201411,1,2014-11-01 13:44:00,2014-11-01 13:47:08,31.237872,121.470259,1709f1d6ad0d111ecedc9e64ab11437d,31.237872-121.470259
188,201411,1,2014-11-01 09:55:49,2014-11-01 12:49:06,31.237872,121.470259,1709f1d6ad0d111ecedc9e64ab11437d,31.237872-121.470259

In [12]:
df_all.nunique()

month               6
date               31
start time    4893125
end time      4908971
latitude         3025
longitude        3035
user id          9618
address          3042
dtype: int64

In [9]:
df_all = df_all[['latitude', 'longitude', 'address']].drop_duplicates()

In [10]:
bs_all = df_all[['latitude', 'longitude', 'address']].drop_duplicates()
bs_all = bs_all.reset_index()
bs_all['id'] = bs_all.index
bs_all.drop(['index'], axis=1)

       latitude   longitude               address    id
0     31.237872  121.470259  31.237872-121.470259     0
1     31.232877  121.487530   31.232877-121.48753     1
2     31.232548  121.478971  31.232548-121.478971     2
3     31.227933  121.453610   31.227933-121.45361     3
4     31.235682  121.487831  31.235682-121.487831     4
...         ...         ...                   ...   ...
3037  31.189711  121.363392  31.189711-121.363392  3037
3038  31.220242  121.403403  31.220242-121.403403  3038
3039  31.224268  121.482064  31.224268-121.482064  3039
3040  31.218517  121.477878  31.218517-121.477878  3040
3041  31.202376  121.434660   31.202376-121.43466  3041

[3042 rows x 4 columns]

In [11]:
bs_all.to_csv('./dataset/bs_all.csv')

In [16]:
bs_all.nunique()

index        3042
latitude     3025
longitude    3035
address      3042
id           3042
dtype: int64

### Min Data (15 Days)

In [12]:
df_min = df_min.dropna()
df_min['address'] = df_min.apply(lambda x: str(x['latitude']) + '-' + str(x['longitude']), axis=1)
df_min.to_csv(f'./dataset/data_min.csv')

In [13]:
bs_min = df_min[['latitude', 'longitude', 'address']].drop_duplicates()

In [14]:
bs_min = bs_min.reset_index()
bs_min['id'] = bs_min.index
bs_min.drop(['index'], axis=1)

       latitude   longitude               address    id
0     31.237872  121.470259  31.237872-121.470259     0
1     31.246946  121.513919  31.246946-121.513919     1
2     31.232877  121.487530   31.232877-121.48753     2
3     31.227933  121.453610   31.227933-121.45361     3
4     31.235682  121.487831  31.235682-121.487831     4
...         ...         ...                   ...   ...
2764  31.286523  121.538876  31.286523-121.538876  2764
2765  31.254745  121.556081  31.254745-121.556081  2765
2766  31.224006  121.423572  31.224006-121.423572  2766
2767  31.209070  121.436851   31.20907-121.436851  2767
2768  31.246433  121.443184  31.246433-121.443184  2768

[2769 rows x 4 columns]

In [15]:
bs_min.to_csv('./dataset/bs_min.csv')

In [21]:
bs_min.head()

   index   latitude   longitude               address  id
0      0  31.237872  121.470259  31.237872-121.470259   0
1     14  31.246946  121.513919  31.246946-121.513919   1
2     15  31.232877  121.487530   31.232877-121.48753   2
3     28  31.227933  121.453610   31.227933-121.45361   3
4     50  31.235682  121.487831  31.235682-121.487831   4